[
  {
    "id": 1,
    "title": "Lilavati Podar High School",
    "description": "In December 2018, Idobro conducted an action research program to train 100 students on the RISE Citizenship program. The students combined SDG’s & RISE values with the college’s theme “Action for Harmony” to promote waste management techniques on the college campus but also in their internship schools across the city.",
    "image": "https://www.idobro.com/wp-content/uploads/2023/06/Lilavati-Podar-High-School.jpg"
  },
  {
    "id": 2,
    "title": "St Xavier's Institute of Learning ",
    "description": "In December 2018, Idobro conducted an action research program to train 100 students on the RISE Citizenship program. The students combined SDG’s & RISE values with the college’s theme “Action for Harmony” to promote waste management techniques on the college campus but also in their internship schools across the city.",
    "image": "https://www.idobro.com/wp-content/uploads/2023/06/St-Xaviers-Institute-of-Learning.jpg"
  },
  {
    "id": 3,
    "title": "Swedish Institute - SSIP",
    "description": "Idobro partnered with the Swedish Institute for the Social and Sustainability Immersion Program (SSIP) over three consecutive years. The program was focused on sharing experiences and to explore collaboration and showcase projects that focus on diversity, inclusion and sustainability among the Swedish Institute Alumni and Swedish companies in India.",
    "image": "https://www.idobro.com/wp-content/uploads/2023/06/I-DO-Bros-3-layer-approach.jpg"
  },
  {
    "id": 4,
    "title": "VVF Limited ",
    "description": "VVF Limited partnered with Idobro to design & implement a Behaviour Change Campaign focused around healthy living through washing of hands in government schools across Maharashtra. The program was implemented in phases, the first targeted 15,000 school children & the second engaged with 35,000. The BCC was designed keeping in mind the target group, i.e. the students and involved various activities such as games, demos, role plays, and videos around the outskirts of Mumbai.",
    "image": "https://www.idobro.com/wp-content/uploads/2023/06/I-DO-Bros-3-layer-approach.jpg"
  },
  {
    "id": 5,
    "title": "Tata Capital Financial Services Ltd",
    "description": "The Employee Engagement & Volunteering activity done with Tata Capital in the year 2016 – 17, was one of the most ‘engaging’ one done with Corporates. Idobro partnered with them from November to March to organise monthly volunteering activities in their branches across 10 cities in India. Activities conducted were around sports, financial literacy, Secret Santa, mentoring students, waste management and clean up of streets, engaging with school children through presentations, quizzes and chart making",
    "image": "https://www.idobro.com/wp-content/uploads/2023/06/I-DO-Bros-3-layer-approach.jpg"
  }


]
