[
    
  {
    "id": 1,
    "title": "Development and Humanitarian Actors Must Come Together for Better Disaster Response: Rajeshwari, UNICEF Maharashtra",
    "description": "Development and humanitarian actors need to collaborate effectively for disaster response, highlighting Rajeshwari’s insights from UNICEF Maharashtra.",
    "image_url": "",
    "link": "#",
    "public_id": ""
  },
  {
    "id": 2,
    "title": "IICA - Sphere India Regional Consultation for Futuristic Collaboration",
    "description": "Collaboration between NGOs, CSR, media & the Government is essential for impact. Stakeholders should be called partners, not donors, says Karon Shaiva of RISE Infinity Foundation.",
    "image_url": "",
    "link": "",
    "public_id": ""
  },
  {
    "id": 3,
    "title": "Caritas India promotes Community-led actions toward LRRD",
    "description": "Caritas India focuses on linking relief and rehabilitation to development and emphasizes nutrition-sensitive initiatives as thrust areas.",
    "image_url": "#",
    "link": "",
    "public_id": ""
  },
  {
    "id": 4,
    "title": "'Global Programme India' improves resilience for marginalized communities",
    "description": "Aims to enhance resilience to natural disasters and improve nutritional and food security for marginalized populations.",
    "image_url": "",
    "link": "",
    "public_id": "",
    "public_id": ""
  },
  {
    "id": 5,
    "title": "Second wave of COVID-19 brings unprecedented challenges",
    "description": "The second wave’s mutation and scale overwhelmed mental and infrastructure readiness, but organizations continue to bring hope with essential support.",
    "image_url": "",
    "link": "",
    "public_id": ""
  },
  {
    "id": 6,
    "title": "19 lakh people supported by MAHA Peconet under RISE4India during COVID-19",
    "description": "Essential supplies and food/medicine support provided to vulnerable groups nationally and internationally during the COVID-19 crisis.",
    "image_url": "2_q7ecnj",
    "link": "",
    "public_id": ""
  },
  {
    "id": 7,
    "title": "Philip Kotler receives RISE Lifetime Achievement Award",
    "description": "Recognizing decades of contribution to marketing and social good, Philip Kotler was honored at the 9th RISE World Summit 2022.",
    "image_url": "",
    "link": "",
    "public_id": ""
  },
  {
    "id": 8,
    "title": "Together, we multiply impact",
    "description": "Since 2009, IDOBRO has curated platforms for knowledge exchange, built the RISE Summit, and nurtured communities benefiting over a million individuals.",
    "image_url": "3_z9tkao",
    "link": ""
  },
  {
    "id": 9,
    "title": "She Is: 75 Indian Women in STEAM",
    "description": "A book series celebrating 75 Indian women in Science, Technology, Engineering, Arts, and Mathematics, showcasing role models and leadership.",
    "image_url": "#",
    "link": "",
    "public_id": ""
  },
  {
    "id": 10,
    "title": "Swedish Consulate organises hub for Nobel Prize Teacher Summit",
    "description": "The summit in Mumbai saw participation from 50+ academic leaders, fostering global education exchange and collaboration.",
    "image_url": "9_lerx6u",
    "link": "",
    "public_id": ""
  },


  {
    "id": 11,
    "title": "COVID-19 Resilience Toolkit for Start-Ups and MSMEs",
    "description": "A toolkit designed to help innovation ecosystem actors recover sustainably after being severely impacted by the COVID-19 crisis.",
    "image_url": "6_mebse0",
    "link": "",
    "public_id": ""
  },
  {
    "id": 12,
    "title": "Relief-on-wheels initiative provides migrants safe passage home",
    "description": "A rapid response initiative implemented within 48 hours to help migrants travel safely during the COVID-19 pandemic.",
    "image_url": "7_lrdvev",
    "link": "",
    "public_id": ""
  },
  {
    "id": 13,
    "title": "WikiGap Edit-a-thon at IIT Bombay",
    "description": "The Swedish Consulate, Idobro Impact Solutions, and Wikimedia India hosted a WikiGap edit-a-thon to improve women’s representation on Wikipedia.",
    "image_url": "8_aojl2q",
    "link": "",
    "public_id": ""
  },
  {
    "id": 14,
    "title": "1000 Stories 1000 Minutes - Idobro Impact Solutions",
    "description": "Mission to alleviate poverty and restore ecosystems across women, social, and green issues during the pandemic, reaching half a million people.",
    "image_url": "#",
    "link": "",
    "public_id": ""
  },
  {
    "id": 15,
    "title": "Embassy of Sweden celebrates 14th Sweden India Nobel Memorial Week",
    "description": "Focus on gender, innovation, and sustainability during Nobel Memorial Week 2021 in collaboration with Idobro Impact Solutions.",
    "image_url": "9_lerx6u",
    "link": "",
    "public_id": ""
  },
  {
    "id": 16,
    "title": "BMC wins awards for distributing food kits during lockdown",
    "description": "The BMC was recognized at RISE World Summit 2021 for its efforts to fight hunger during the COVID-19 lockdown.",
    "image_url": "10_fatn2a",
    "link": "",
    "public_id": ""
  },
  {
    "id": 17,
    "title": "RISE World Summit 2021 - A global call for collective action",
    "description": "Virtual edition exploring impact-driven interventions and innovations through global collaborations to achieve SDGs.",
    "image_url": "#",
    "link": "",
    "public_id": ""
  },
  {
    "id": 18,
    "title": "India leads SDG dialogue with 56 countries at RISE World Summit 2022",
    "description": "A 3-day global summit bringing together organizations from 56 countries with over 4,000 participants to drive SDG action.",
    "image_url": "",
    "link": "",
    "public_id": ""
  },
  {
    "id": 19,
    "title": "Two ways to turn waste into money: SEED Award Winners in India",
    "description": "Recognizing eco-inclusive enterprises for their contributions to green and inclusive growth in India.",
    "image_url": "15_a5323y",
    "link": "",
    "public_id": ""
  },
  {
    "id": 20,
    "title": "Nutritionally rich Indian recipes for better health",
    "description": "A contest promoting local and traditional ingredients to improve nutritional values and encourage healthy eating habits.",
    "image_url": "16_spu0i5",
    "link": "" ,
    "public_id": ""
  },
  {
    "id": 21,
    "title": "Think Big - Think Forward",
    "description": "Karon Shaiva encourages women entrepreneurs to persist through adversity and create innovative solutions despite constraints.",
    "image_url": "17_xmvrrr",
    "link": "",
    "public_id": ""
  },
  {
    "id": 22,
    "title": "The Taj Must Smile campaign",
    "description": "A collaborative campaign with Weber Shandwick PR and Idobro as the knowledge partner to spread awareness and support social causes.",
    "image_url": "18_bgoaoq",
    "link": "",
    "public_id": ""
  },
  {
    "id": 23,
    "title": "Saamne Aa - Beti Bachao Beti Padhao initiative launched",
    "description": "A campaign to promote gender equality through public screenings and awareness programs across Mumbai.",
    "image_url": "19_jjvqgy",
    "link": "",
    "public_id": ""
  },
  {
    "id": 24,
    "title": "WTC Goa partners for workshop on gender equality",
    "description": "World Trade Centre Goa collaborates with Idobro Impact Solutions to organize the Sandvik India Gender Awards workshop.",
    "image_url": "20_iumzak",
    "link": "",
    "public_id": "",
    "public_id": ""
  },
  {
    "id": 25,
    "title": "RISE Summit 2019",
    "description": "Focus on breakthrough interactions rather than innovations, fostering meaningful global dialogues.",
    "image_url": "",
    "link": "",
    "public_id": ""
  },
  {
    "id": 26,
    "title": "The RISE World Summit: Charting a New Course for Impactful Change",
    "description": "Idobro leverages citizenship, entrepreneurship, and partnership to address pressing global challenges.",
    "image_url": "21_osyagf",
    "link": "",
    "public_id": ""
  },
  {
    "id": 27,
    "title": "Paradigm Shift For The Millennial World",
    "description": "Idobro facilitates deeper engagement to implement market-based solutions following the RISE values.",
    "image_url": "23_wsobwx",
    "link": "",
    "public_id": ""
  },
  {
    "id": 28,
    "title": "Process Innovation - The Next Wave to Power Social Agenda",
    "description": "Examining the importance of process innovation in driving business and social success.",
    "image_url": "29_q4yxer",
    "link": "",
    "public_id": ""
  },
  {
    "id": 29,
    "title": "Citizenship: The Force for a Better World",
    "description": "How citizenship has become central to socio-economic and political development globally.",
    "image_url": "25_mcir6z",
    "link": ""
  },
  {
    "id": 30,
    "title": "The new social networking",
    "description": "Highlights from the last RISE event, including social tours that led to impactful community actions.",
    "image_url": "26_wo3pw3",
    "link": ""
  },
  {
    "id": 31,
    "title": "Multiplying impact: The Idobro way",
    "description": "A case study of Idobro, a Mumbai-based social enterprise founded by Karon Shaiva, examining its strategic growth and challenges.",
    "image_url": "27_alz3ql",
    "link": ""
  },
  {
    "id": 32,
    "title": "Women of every ilk helped the world fight Covid",
    "description": "Karon Shaiva was among 11 #COVIDsheroes recognized for relief, recovery, and rehabilitation efforts during the pandemic.",
    "image_url": "",
    "link": ""
  },
  {
    "id": 33,
    "title": "Ushering Transformational Change Through Real World Partnerships",
    "description": "Explores how multi-stakeholder partnerships can create real impact despite leadership and ownership challenges.",
    "image_url": "",
    "link": ""
  },
  {
    "id": 34,
    "title": "CSR is charity, not a marketing gimmick",
    "description": "Karon Shaiva shares views on the government's role in making CSR impactful and tangible for companies.",
    "image_url": "29_q4yxer",
    "link": ""
  },
  {
    "id": 35,
    "title": "Collaboration – Comfort or Crucial",
    "description": "Hema Ganachari reflects on her transition from exports to development work with Idobro Impact Solutions.",
    "image_url": "30_h61srq",
    "link": ""
  },
  {
    "id": 36,
    "title": "RISE Summit 2016 in Mumbai and Pune",
    "description": "The 4th Annual RISE Summit was hosted in Mumbai and Pune, fostering dialogue on impact-driven initiatives.",
    "image_url": "#",
    "link": ""
  },
  {
    "id": 37,
    "title": "Multiplying impact",
    "description": "Idobro continues its mission of multiplying opportunities for women and green initiatives amid organizational challenges.",
    "image_url": "31_w5f8op",
    "link": ""
  },
  {
    "id": 38,
    "title": "Celebrate this festival with unique, homemade goodies",
    "description": "RISE promotes women entrepreneurs by supporting handmade, eco-friendly, and socially impactful products.",
    "image_url": "32_bseltt",
    "link": ""
  },
  {
    "id": 39,
    "title": "Creating a Long Term Impact - Scale, Sustainability, and Spread",
    "description": "Discusses the importance of spreading knowledge and templates for greater social change.",
    "image_url": "",
    "link": ""
  },
  {
    "id": 40,
    "title": "CSR Roadmap on Sanitation",
    "description": "A workshop by Idobro and Habitat for Humanity focused on creating a CSR roadmap for improving sanitation.",
    "image_url": "",
    "link": ""
  }
]


