[
  {

    "projectName": "Sandvik India Diversity Awards",
    "description": "Launched in March 2016, this award focused on exemplary leadership in promoting diversity & inclusion across Maharashtra. Idobro partnered with Sandvik Asia Pvt. Ltd. for two consecutive years to design and implement the program end-to-end, including mentor organization, jury identification, and creating the social media platform. The process had three rounds of selection, followed by a mentoring program where senior professionals guided participants in preparing their final pitch and strategy."
  },
  {
    "projectName": "Glenmark Foundation - Communication Catalyst",
    "description": "In partnership with Glenmark Foundation, Idobro designed the Communication Catalyst to connect the creativity of students with NGOs lacking resources. The initiative aimed to tackle malnutrition in low-income households using innovative strategies. Starting in Mumbai in 2016, it later expanded into a nationwide competition with a mentorship program for 10 selected teams annually."
  },
  
  {
    "projectName": "Yes Bank – I am the Change Program",
    "description": "Idobro partnered with Yes Bank Foundation for two years as outreach and implementation partner for workshops under the 'Yes I am the Change' program. Idobro managed venues, facilitators, outreach, and registrations across multiple metro cities. Over 560 people attended the workshops, ensuring successful facilitation and participation."
  },
  {
    "projectName": "COE SA – Evaluation Conclave, Nepal",
    "description": "The Community of Evaluators and Community of Evaluators Nepal organized the Second Evaluation Conclave in Kathmandu (26th February–1st March 2013). Idobro handled end-to-end event design and execution, including ticketing and tourism for international delegates. The conclave aimed to bring together evaluation practitioners, commissioners, and thinkers to share advancements in evaluation theory and practice."
  },
  {
    "projectName": "Glenmark Foundations – Meri Poushtik Rasoi",
    "description": "With Glenmark Foundation’s focus on malnutrition, Idobro created 'Meri Poushtik Rasoi', a cooking competition highlighting traditional and indigenous recipes across India. The goal was to share recipes with NGOs and stakeholders working on malnutrition. The event saw over 500 entries in its first edition and more than 700 in the second, with the final cook-off judged by professional chefs in Mumbai."
  },
  {
    "projectName": "Trent Limited – NGO Due Diligence",
    "description": "Trent Limited supports NGO projects in child education and nutrition through its Star & Diya initiative in Westside stores. Customers contributed by lighting diyas during Diwali or adding stars to Christmas trees, with proceeds going to NGOs. Idobro partnered with Trent for three years to identify, evaluate, and conduct due diligence on NGOs across India."
  },
  {
    "projectName": "Tata Capital – Impact Assessment",
    "description": "Idobro partnered with Tata Capital to conduct an impact assessment of education and health programs in six sick tea gardens. Using PRA techniques and stakeholder interviews, Idobro evaluated the direct and indirect effects on beneficiaries. The findings helped identify key strategies such as partnerships and value additions to scale impact. A follow-up needs assessment was carried out in 19 tea gardens for program expansion."
  },
  {
    "projectName": "Godrej Group – Brand Perceptions Analysis",
    "description": "Two Godrej group companies engaged Idobro for brand perception studies in Maharashtra and Uttarakhand. The studies measured changes in community perceptions compared to administration perceptions using a predefined index. Findings influenced local social programs. A follow-up study two years later tracked perception shifts within communities."
  },
  {
    "projectName": "Mahindra Susten - Environmental Social Impact Assessment",
    "description": "Mahindra Renewable Private Limited worked with Idobro for an ESIA of part of Gujarat Solar Park, the world’s third-largest photovoltaic power site. The study adhered to IFC Standard 1 and World Bank requirements. Idobro engaged with local stakeholders and government representatives to create targeted community engagement plans, fostering development and improving local livelihoods."
  }
]
